app/Livewire/Pages/Auth/LoginComponent.php

    public function login(Request $request)
    {

        $this->validate();

        try {
            $user = User::where('username', $this->username)->first();
---
select * from `users` where `username` = 'raj' limit 1