app/Livewire/Pages/AdminDashboardComponent.php

    public function render()
    {
        $count = [
           'store' => Location::whereIsActive(true)->get()->count(),
        ];
---
select * from `locations` where `is_active` = 1