app/Livewire/Pages/Data/CustomerComponent.php

select * from `customers` limit 25 offset 0
select count(*) as aggregate from `customers`
---
    public function render()
    {
        $locations = Location::whereIsActive(true)->pluck('name','id');
        $customers = Customer::paginate(25);

select * from `customers` where `customers`.`id` = 4 limit 1
---
    public function edit($id)
    {
        $this->updateMode = true;

        $this->customer['id'] = $id;

        $customer = Customer::findOrFail($this->customer['id']);

select * from `customers` where `customers`.`id` = 6 limit 1
---

        try {

            $customer = $this->customer['id'] ? Customer::findOrFail($this->customer['id'])  : new Customer;

insert into `customers` (`customer_name`, `customer_id`, `location_id`, `email`, `address`, `dob`, `mobile`, `phone`, `remark`, `is_active`, `updated_at`, `created_at`) values ('saMANTHAAS', 'csdcqsx', 'adascasxx', 'ascxscsacas@gmail.com', 'chunnakam', '1998/07/26', 'aasvec', 'XASXAS', '\"XCAC\"', 1, '2024-03-05 10:53:47', '2024-03-05 10:53:47')
update `customers` set `customer_name` = 'SAmnatha', `is_active` = 0, `customers`.`updated_at` = '2024-03-05 10:54:03' where `id` = 6
---


            // Save the customer data here
            $customer->save();

select * from `customers` where `customers`.`id` = 6 limit 1
delete from `customers` where `id` = 6
---
    public function delete($id)
    {
        $customer = Customer::find($id);
        if ($customer) {
            $customer->delete();