app/Livewire/Pages/Data/LocationComponent.php

select * from `locations` limit 25 offset 0
select count(*) as aggregate from `locations`
---
    public function render()
    {
        $locations = Location::paginate(25);

select * from `locations` where `locations`.`id` = 2 limit 1
delete from `locations` where `id` = 2
---
    public function delete($id)
    {
        $location = Location::find($id);
        if ($location) {
            $location->delete();